/* 
1-1. 입력된 수가 짝수라면 2로 나눕니다. 
1-2. 입력된 수가 홀수라면 3을 곱하고 1을 더합니다. 
2. 결과로 나온 수에 같은 작업을 1이 될 때까지 반복합니다. 

예를 들어, 주어진 수가 6이라면 6 → 3 → 10 → 5 → 16 → 8 → 4 → 2 → 1 이 되어 총 8번 만에 1이 됩니다. 
위 작업을 몇 번이나 반복해야 하는지 반환하는 함수, solution을 완성해 주세요. 
단, 주어진 수가 1인 경우에는 0을, 작업을 500번 반복할 때까지 1이 되지 않는다면 –1을 반환해 주세요.
*/

function solution(num) {
  // 1인 경우 0 (빠른 반환)
  if (num === 1) return 0;
  let count = 0;

  // 500번 반복 전까지
  // 1이 될때까지의 작업 수(=count) 세기
  while (count <= 500) {
    num = num % 2 === 0 ? num / 2 : num * 3 + 1;
    count++;
    if (num === 1) return count;
  }

  // 500 초과 시 -1 반환
  return -1;
}

solution(6);
