/* 
정답은 아무에게도 말하지 마세요.

콜라 빈 병 2개를 가져다주면 콜라 1병을 주는 마트가 있다. 빈 병 20개를 가져다주면 몇 병을 받을 수 있는가?

단, 보유 중인 빈 병이 2개 미만이면, 콜라를 받을 수 없다.
*/

// 마트에 주어야 할 병 수 a
// 마트가 주는 콜라 병 수 b
// 상빈이가 가지고 있는 빈 병의 개수 n
// 받은 콜라 병 수 를 반환

function solution(a, b, n) {
  var answer = 0;

  // 2개 미만 되기 전까지
  // 받을 수 있는 콜라 병 수 세기
  while (a <= n) {
    // 교환할 수 있는 콜라 병 수
    const exchange = Math.floor(n / a);
    // 교환할 수 있는 콜라 병 수에 마트가 주는 콜라 병 수 곱하기
    const cola = exchange * b;

    // answer에 콜라 병 수 더해준 후
    // 상빈이가 가지고 있는 빈 병의 개 수 갱신해주기
    // n = 교환하고 남은 병 수 + 콜라 병 수
    answer += cola;
    n = (n % a) + cola;
  }

  return answer;
}

solution(3, 1, 20);
